using System;
using System.Collections.Generic;

class Program
{
    static List<string> availableMovies = new List<string>()
    {
        "Хоббіт: Пустка Смауга (фентезі, пригодницький)",
        "Володар перснів: Братство кільця (фентезі, пригодницький)",
        "Темний рицар (екшн, драма, кримінальний)",
        "Залізна Людина (екшн, фантастика, пригодницький)",
        "Месники: Фінал (екшн, фантастика)",
        "Чорна Вдова (екшн, пригодницький)",
        "Зоряні війни Епізод 5: Імперія наносить зворотній удар (фантастика, фентезі, пригодницький, бойовик)",
        "Матриця (фантастика, екшн)",
        "Закляття (жахи, трилер)",
        "Піран'ї (жахи, комедія)",
        "Інтерстеллар (фантастика, драма)",
        "Сяйво (жахи, драма)",
        "Форсаж 10 (екшн, пригодницький)",
        "Дракула (жахи, фентезі)",
        "Барбі (анімація, сімейний)",
        "Драйв (екшн, кримінальний, драма)",
        "Той, хто біжить по лезу 2049 (фантастика, трилер, драма)"
    };

    // Словник для збереження заброньованих квитків
    static Dictionary<string, Dictionary<string, List<Tuple<string, string, int>>>> bookedTickets = new Dictionary<string, Dictionary<string, List<Tuple<string, string, int>>>>();

    static decimal ticketPrice = 125.00m;
